__author__ = 'Пономарев Федор Анатольевич'

# Задание-1:
# Матрицы в питоне реализуются в виде вложенных списков:
# Пример. Дано:
matrix = [[1, 0, 8],
          [3, 4, 1],
          [0, 4, 2]]

# Выполнить поворот (транспонирование) матрицы
# Пример. Результат:
matrix_rotate = [[1, 3, 0],
                  [0, 4, 4],
                  [8, 1, 2]]

# Суть сложности hard: Решите задачу в одну строку
matrix_tr = list(zip(*matrix))
print (matrix)
print(matrix_tr)
# Задание-2:
# Найдите наибольшее произведение пяти последовательных цифр в 1000-значном числе.
# Выведите произведение и индекс смещения первого числа последовательных 5-ти цифр.
# Пример 1000-значного числа:
number = """
73167176531330624919225119674426574742355349194934
96983520312774506326239578318016984801869478851843
85861560789112949495459501737958331952853208805511
12540698747158523863050715693290963295227443043557
66896648950445244523161731856403098711121722383113
62229893423380308135336276614282806444486645238749
30358907296290491560440772390713810515859307960866
70172427121883998797908792274921901699720888093776
65727333001053367881220235421809751254540594752243
52584907711670556013604839586446706324415722155397
53697817977846174064955149290862569321978468622482
83972241375657056057490261407972968652414535100474
82166370484403199890008895243450658541227588666881
16427171479924442928230863465674813919123162824586
17866458359124566529476545682848912883142607690042
24219022671055626321111109370544217506941658960408
07198403850962455444362981230987879927244284909188
84580156166097919133875499200524063689912560717606
05886116467109405077541002256983155200055935729725
71636269561882670428252483600823257530420752963450"""
new_number=""   #Нельзя было взять число без спецсимволов???
number = number.strip("\n")
number = number.split("\n")
for itm in number:
    new_number = new_number + str(itm)
number = new_number
from functools import reduce
maximum = 0
offset = 0
for i in range(len(number)):
    n = list(map(int, number[i:i+5]))
    proiz = reduce(lambda x, y: x*y, n)
    if proiz>maximum:
        maximum = proiz
        offset = i
print("Масимальное произведение равно = ", maximum, "Индес от начала числа: ", offset)
print(number[offset:offset+5])
# Задание-3 (Ферзи):
# Известно, что на доске 8×8 можно расставить 8 ферзей так, чтобы они не били
# друг друга. Вам дана расстановка 8 ферзей на доске.
# Определите, есть ли среди них пара бьющих друг друга.
# Программа получает на вход восемь пар чисел,
# каждое число от 1 до 8 — координаты 8 ферзей.
# Если ферзи не бьют друг друга, выведите слово NO, иначе выведите YES.
pole = [[0,0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0,0]]
def fill_pole(x, y):
    for i in range(8):
        pole[x][i] = 1
    for i in range(8):
        pole[i][y] = 1
    a, b = x, y
    while a >= 0 and b >= 0:
        pole[a][b] = 1
        a -= 1
        b -= 1
    a, b = x, y
    while a <= 7 and b >= 0:
        pole[a][b] = 1
        a += 1
        b -= 1
    a, b = x, y
    while a >= 0 and b <=7:
        pole[a][b] = 1
        a -= 1
        b += 1
    a, b = x, y
    while a <= 7 and b <= 7:
        pole[a][b] = 1
        a += 1
        b += 1
a = 0
x = 1
print("Y")
for line in pole:
    print(x,"  -- ", line)
    x += 1
print("ОСЬ  --  1, 2, 3, 4, 5, 6, 7, 8  ----X")
for i in range(8):
    x = int(input("Введите координаты {}-го ферзя от 1 до 8 x{} ".format(i+1, i + 1)))
    y = int(input("Введите координаты {}-го ферзя от 1 до 8 y{}".format(i+1, i + 1)))
    if pole[y-1][x-1] == 1:
        print("Ферзь бьется")
        a = 1
        break
    else:
        fill_pole(y-1,x-1)
if not a: print("Ферзи не бьются")

for line in pole:
    print(line)
